# -*- coding: utf-8
global t_dictionary

t_dictionary = {
    "analysts":          'Таблица с информацией про лаборантов.',
    "brigades":          'Таблица бригад по участкам.',
    "chief_section":     'Таблица с информацией о начальниках участка.',
    "chief_workshop":    'Таблица с информацией о начальниках цеха.',
    "declars":           'Таблица деклараций прихода-принятия партий.',
    "employeer_w_m_b_p": 'Таблица сотрудников, распределенных по бригада-участок.',
    "employees":         'Таблица полной информации о сотрудниках.',
    "employees_view_tw": 'Таблица сотрудников ИТР.',
    "employees_view_w":  'Таблица сотрудников рабочих должностей.',
    "equipment":         'Таблица списка оборудования.',
    "equipment_lab":     'Таблица привязки обородования к лаборатории.',
    "fin_prod":          'Таблица готовых изделий на предприятии.',
    "formula_fin_prod":  'Таблица формул изготовления готовых изделий и их выход.',
    "items":             'Таблица деталей для сборки изделий.',
    "laboratories":      'Таблица списка лобораторий.',
    "plot":              'Таблица списка участков.',
    "position_tech":     'Таблица ИТР должностей.',
    "position_worker":   'Таблица рабочих должностей.',
    "suppliers":         'Таблица поставщиков деталей.',
    "tests":             'Таблица проведенных испытаний изделий.',
    "types_move":        'Таблица типов движения.',
    "types_prod":        'Таблица видов готовых изделий.',
    "types_test":        'Таблица видов исспытаний.',
    "types_work":        'Таблица видов выполенных работ.',
    "warehouses":        'Таблица списка складов.',
    "wh_materials":      'Таблица операций движения материаллов.',
    "wh_prod":           'Таблица Изделие-Склад.',
    "works":             'Таблица выполненных работ.',
    "workshop":          'Таблица списка цехов предприятия.',
    "view_#1":           'Перечень видов изделий отдельной категории и в целом, собираемых указанным цехом.',
    "view_#2":           'Число и перечень изд. отд. кат. и в целом, собранных указанным цехом, уч-ом за опред. время.',
    "view_#3_1":         'Данные о кадровом составе цеха рабочего персонала.',
    "view_#3_2":         'Данные о кадровом составе цеха инженерно-технического персонала.',
    "view_#4_1":         'Перечень участков и их начальников.',
    "view_#4_2":         'Количество участков в цеху',
    "view_#5":           'Перечень работ, которые проходит указанное изделие.',
    "view_#6":           'Состав бригад указанного участка, цеха.',
    "view_#7":           'Список мастеров указанного участка, цеха.',
    "view_#8":           'Перечень изделий отд. кат. и в целом, собираемых в настоящий момент указ. участком, цехом.',
    "view_#9":           'Состав бригад, участвующих в сборке указанного изделия.',
    "view_#10":          'Перечень испытательных лабораторий, участвующих в испытаниях некоторого конкретного изделия.',
    "view_#11":          'Перечень изделий отд. кат. и в целом, проход. испытание в указ. лаб-рии за опред. период.',
    "view_#12":          'Список испыт-ей,участ.в исп-ях указ.изд., изд. отд.кат. и в целом в нек. лабор-ии за период.',
    "view_#13":          'Состав оборуд., исп. при испыт. указ. изделия, изделий отд.кат. и в целом в лаб. за период.',
    "view_#14":          'Число изделий отд. кат. и в целом, собираемых в настоящий момент указ. участком, цехом.'
}



#print(t_dictionary["analysts"])